In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [21]:
def impute_nan(df,variable):    
    df[variable+'_d']=df[variable]
    random_sample=df[variable].dropna().sample(df[variable].isnull().sum(),random_state=0)
    random_sample.index=df[df[variable].isnull()].index
    df.loc[df[variable].isnull(),variable+'_d']=random_sample

In [22]:
impute_nan(df,'Age')

In [23]:
df.head()

   Survived   Age     Fare  Agerandom  Age_dom  Age_d
0         0  22.0   7.2500       22.0     22.0   22.0
1         1  38.0  71.2833       38.0     38.0   38.0
2         1  26.0   7.9250       26.0     26.0   26.0
3         1  35.0  53.1000       35.0     35.0   35.0
4         0  35.0   8.0500       35.0     35.0   35.0

In [26]:
df.loc[df['Age'].isnull()]

     Survived  Age     Fare  Agerandom  Age_dom  Age_d
5           0  NaN   8.4583      28.00      NaN  28.00
17          1  NaN  13.0000      50.00      NaN  50.00
19          1  NaN   7.2250       0.92      NaN   0.92
26          0  NaN   7.2250      36.00      NaN  36.00
28          1  NaN   7.8792      26.00      NaN  26.00
..        ...  ...      ...        ...      ...    ...
859         0  NaN   7.2292      22.00      NaN  22.00
863         0  NaN  69.5500      25.00      NaN  25.00
868         0  NaN   9.5000      15.00      NaN  15.00
878         0  NaN   7.8958      34.00      NaN  34.00
888         0  NaN  23.4500      15.00      NaN  15.00

[177 rows x 6 columns]

In [27]:
random_sample

NameError: name 'random_sample' is not defined

In [28]:
random_sample=df['Age'].dropna().sample(df['Age'].isnull().sum(),random_state=0)

In [29]:
random_sample

423    28.00
177    50.00
305     0.92
292    36.00
889    26.00
       ...
539    22.00
267    25.00
352    15.00
99     34.00
689    15.00
Name: Age, Length: 177, dtype: float64